app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations"
---
  def index
    @registrations = Registration.all

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" IS NULL LIMIT 1
---
  def new
    @registration = Registration.new
    @course = Course.find_by id: params["course_id"]

INSERT INTO "registrations" ("card_token", "course_id", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?, ?)  [["card_token", "tok_195jrgHQ9Zk11fEzWXt0jTGc"], ["course_id", 1], ["created_at", "2016-10-17 22:45:57.695512"], ["email", "jonfarrell@me.com"], ["updated_at", "2016-10-17 22:45:57.695512"]]
---
  def create
    @registration = Registration.new(registration_params.merge(email: stripe_params["stripeEmail"], card_token: stripe_params["stripeToken"]))
    raise "Please, check registration errors" unless @registration.valid?
    @registration.process_payment
    @registration.save